
#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура NES_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	NES_ВывестиПолеСтатуса();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура NES_ВывестиПолеСтатуса()
	
	Если Элементы.Найти("NESСтатус") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаШапкаЛево = Элементы.Найти("ГруппаШапкаЛево");
	Если ГруппаШапкаЛево = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Метаданные.Документы.Анкета.Реквизиты.Найти("NESСтатус") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементПеред = Неопределено;
	ПолеРежима = Элементы.Найти("РежимАнкетирования");
	Если ПолеРежима <> Неопределено И ПолеРежима.Родитель = ГруппаШапкаЛево Тогда
		ПодчиненныеЭлементы = ГруппаШапкаЛево.ПодчиненныеЭлементы;
		ИндексРежима = ПодчиненныеЭлементы.Индекс(ПолеРежима);
		Если ИндексРежима + 1 < ПодчиненныеЭлементы.Количество() Тогда
			ЭлементПеред = ПодчиненныеЭлементы.Получить(ИндексРежима + 1);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭлементПеред = Неопределено Тогда
		ПолеСтатуса = Элементы.Добавить("NESСтатус", Тип("ПолеФормы"), ГруппаШапкаЛево);
	Иначе
		ПолеСтатуса = Элементы.Вставить("NESСтатус", Тип("ПолеФормы"), ГруппаШапкаЛево, ЭлементПеред);
	КонецЕсли;
	
	ПолеСтатуса.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСтатуса.ПутьКДанным = "Объект.NESСтатус";
	
КонецПроцедуры

#КонецОбласти
