#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьНастройкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ПрочитатьНастройкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ЗаписатьНастройкиЗавершение", ЭтотОбъект),
		"Записать изменения в настройки сервиса 1С:Кабинет сотрудника?",
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаписатьНастройкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаписатьНастройкиНаСервере();
		ПоказатьОповещениеПользователя("Настройки сервиса 1С:Кабинет сотрудника записаны");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиНаСервере()
	
	Запись = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьМенеджерЗаписи();
	Запись.Прочитать();
	
	АдресПриложения = Запись.АдресПриложения;
	АдресПриложенияПоИмени = Запись.АдресПриложенияПоИмени;
	АдресПриложенияПоИмениДоступен = Запись.АдресПриложенияПоИмениДоступен;
	АдресСервисаАвторизации = Запись.АдресСервисаАвторизации;
	АдресРесурсовAPI = Запись.АдресРесурсовAPI;
	Идентификатор = Запись.Идентификатор;
	ИдентификаторПриложения = Запись.ИдентификаторПриложения;
	Наименование = Запись.Наименование;
	НаименованиеПриложения = Запись.НаименованиеПриложения;
	ВерсияПриложения = Запись.ВерсияПриложения;
	ВерсияDTO = Запись.ВерсияDTO;
	ВерсияAPI = Запись.ВерсияAPI;
	ВыполнятьРегламентноеЗадание = Запись.ВыполнятьРегламентноеЗадание;
	СервисЗаблокирован = Запись.СервисЗаблокирован;
	РегламентныеЗаданияЗаблокированы = Запись.РегламентныеЗаданияЗаблокированы;
	ТребуетсяОбновитьНастройкиФункциональности = Запись.ТребуетсяОбновитьНастройкиФункциональности;
	ДатаНедоступностиПриложения = Запись.ДатаНедоступностиПриложения;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	
	Запись = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьМенеджерЗаписи();
	Запись.Прочитать();
	
	Запись.АдресПриложения = АдресПриложения;
	Запись.АдресПриложенияПоИмени = АдресПриложенияПоИмени;
	Запись.АдресПриложенияПоИмениДоступен = АдресПриложенияПоИмениДоступен;
	Запись.АдресСервисаАвторизации = АдресСервисаАвторизации;
	Запись.АдресРесурсовAPI = АдресРесурсовAPI;
	Запись.Идентификатор = Идентификатор;
	Запись.ИдентификаторПриложения = ИдентификаторПриложения;
	Запись.Наименование = Наименование;
	Запись.НаименованиеПриложения = НаименованиеПриложения;
	Запись.ВерсияПриложения = ВерсияПриложения;
	Запись.ВерсияDTO = ВерсияDTO;
	Запись.ВерсияAPI = ВерсияAPI;
	Запись.ВыполнятьРегламентноеЗадание = ВыполнятьРегламентноеЗадание;
	Запись.СервисЗаблокирован = СервисЗаблокирован;
	Запись.РегламентныеЗаданияЗаблокированы = РегламентныеЗаданияЗаблокированы;
	Запись.ТребуетсяОбновитьНастройкиФункциональности = ТребуетсяОбновитьНастройкиФункциональности;
	Запись.ДатаНедоступностиПриложения = ДатаНедоступностиПриложения;
	
	Запись.Записать();
	
	ПрочитатьНастройкиНаСервере();
	
КонецПроцедуры

#КонецОбласти
